<a id="19"></a> <br>
# DataFrame Operations And Pivot Table:


Let's create our data and start.

In [153]:
data = {'Column1': [1,2,3,4,5,6], 'Column2': [1000,1000,2000,3000,3000,1000],'Column3': ['Mace Windu','Darth Vader','Palpatine','Kylo Ren','Rey','Obi-Wan']}
df = pd.DataFrame(data)
df

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan


And let's come to our small but functional functions.

In [154]:
df.head()

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey

In [155]:
df.head(n = 2) # df.head(2) = df.head(n = 2)

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader


'Head ()' shows the top 5 values, but it can show as much as the value it includes. In the example 2 is given. Likewise, "tail ()" shows the last 5 values. It can also take a value like 'head ()'.

In [156]:
df.describe()

        Column1      Column2
count  6.000000     6.000000
mean   3.500000  1833.333333
std    1.870829   983.192080
min    1.000000  1000.000000
25%    2.250000  1000.000000
50%    3.500000  1500.000000
75%    4.750000  2750.000000
max    6.000000  3000.000000

In [157]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Column1,6.0,3.500000,1.870829,1.0,2.25,3.5,4.75,6.0
Column2,6.0,1833.333333,983.192080,1000.0,1000.00,1500.0,2750.00,3000.0

You can obtain more statistical values ​​by using '.T'

In [158]:
df.info

<bound method DataFrame.info of    Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan>


While 'describe ()' gives some statistical information, 'corr ()' gives correlation information. But as it is not compatible with this data, we will explain below. "Info ()", as the name suggests, provides basic information. We recommend using these functions as this will be your first look at the data.

In [159]:
df['Column2'].unique()

array([1000, 2000, 3000])

In [160]:
df['Column2'].nunique()

3


'Unique ()' tells us how many 'unique' data the data is given. The code below gives the number of 'unique' values.

In [161]:
df['Column2'].value_counts()

1000    3
3000    2
2000    1
Name: Column2, dtype: int64

'Value_counts ()' is a function that returns how many of which value.

In [162]:
df[df['Column1'] >= 2]

   Column1  Column2      Column3
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [163]:
df[(df['Column1'] >= 1) & (df['Column2'] == 1000) ]

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
5        6     1000      Obi-Wan


As it turns out, we can also use 'DataFrame Filtering' operations here.

In [164]:
def square(x): 
    return x ** 2
square(2)

4


Here we created a Function and let it give the square of the value it contains.

In [165]:
df['Column2'].apply(square)

0    1000000
1    1000000
2    4000000
3    9000000
4    9000000
5    1000000
Name: Column2, dtype: int64


When we put this function into our data with 'apply ()', it gave us the squares.
You can use this special case in your projects. For example, you are examining the data of the engine part of the vehicle and your team requested a finding from the engine. You can take the necessary mathematical formula from them and use it just like this example, and you can easily do your job.
But there is a shorter way.


These roads can work for you in areas such as ML, NLP.

In [166]:
lambda x : x **2

In [167]:
df['Column2'].apply(lambda x : x **2 )

0    1000000
1    1000000
2    4000000
3    9000000
4    9000000
5    1000000
Name: Column2, dtype: int64


'Lambda' is generally preferred because it is shorter

In [168]:
# df['Column2'] = df['Column2'].apply(square) for code's update


However, your data is not updated automatically when you do these things. You need to update it, we do it as above.

In [169]:
df['Column3']

0     Mace Windu
1    Darth Vader
2      Palpatine
3       Kylo Ren
4            Rey
5        Obi-Wan
Name: Column3, dtype: object

In [170]:
df['Column3'].apply(len) 
# Get the length of the string

0    10
1    11
2     9
3     8
4     3
5     7
Name: Column3, dtype: int64

In [171]:
df.drop('Column3', axis = 1 )

   Column1  Column2
0        1     1000
1        2     1000
2        3     2000
3        4     3000
4        5     3000
5        6     1000

In [172]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [173]:
df.index.names

FrozenList([None])


We have done some of the above functions before. The 'df.index' function is probably not the only thing I describe. He also started from '0' to '6', '1' and '1' each. Its meaning under it is that simple. Now let's move on to sort_values ​​().
You see the parameters it receives below. "By" specifies what to get, while "ascending" specifies what to rank. You can sort from small to large or large to small. You already know the 'Axis' and 'Inplace' parameters. You can edit your data according to the 3 types of "kind" parameter below. It is not used much, but if you want, you can search. 'Na_postion' allows you to specify the position of 'NaN' values.

In [174]:
df

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [175]:
df.sort_values(by=['Column1', 'Column3'])# More than one value can be 'Sort'.

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

This function allows us to sort by a certain value. Here, we have provided the ranking according to "Column2". Above, we have listed 'Column1' and 'Column3' so that you can see the difference.

In [176]:
df.sort_values('Column2', ascending = True) #from small to large

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
5        6     1000      Obi-Wan
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey

In [177]:
df.sort_values('Column2', ascending = False) # from large to small

   Column1  Column2      Column3
3        4     3000     Kylo Ren
4        5     3000          Rey
2        3     2000    Palpatine
0        1     1000   Mace Windu
1        2     1000  Darth Vader
5        6     1000      Obi-Wan

In [178]:
df.sort_values('Column1', kind = 'heapsort')

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [179]:
df.sort_values('Column1', kind = 'mergesort')

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [180]:
df.sort_values('Column1', kind = 'quicksort')

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [181]:
df.sort_values('Column1', na_position = 'first')

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [182]:
df.sort_values('Column1', na_position = 'last')

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan


Our data is not very suitable for some parameters (kind and na_position). Some gave the same result. But we also wanted to show how it's done. As we said, it is not used much, you can search if you want.
Let's come to the 'Pivot Table' topic. There is nothing to be afraid of if you know Excel. Because it's exactly the same. If you don't know, don't worry. Because it has a very simple usage.

In [183]:
df = pd.DataFrame({'Month': ['January','February','March','January','February','March','January','February','March'],'State':['New York','New York','New York','Texas','Texas','Texas','Washington','Washington','Washington'],
'moisture': [20,25,65,34,56,85,21,56,79]})
df

      Month       State  moisture
0   January    New York        20
1  February    New York        25
2     March    New York        65
3   January       Texas        34
4  February       Texas        56
5     March       Texas        85
6   January  Washington        21
7  February  Washington        56
8     March  Washington        79


Before we started, we said we'd talk about corr (). Let's explain it here (although the data is not suitable). As we mentioned before, it tells about the correlation.

In [184]:
df.corr()

          moisture
moisture       1.0

Let's say we have 3 percent humidity in 3 different cities in 3 different months.

In [185]:
df.pivot_table(index = 'Month', columns = 'State', values = 'moisture')

State     New York  Texas  Washington
Month
February        25     56          56
January         20     34          21
March           65     85          79

In [186]:
df.pivot_table(index = 'State', columns = 'Month', values = 'moisture')

Month       February  January  March
State
New York          25       20     65
Texas             56       34     85
Washington        56       21     79


You can create a pivot table as above. It's that simple.

<a id="20"></a> <br>
# Methods of Reading the Data Set:


This issue can actually be explained by the following.

dataset = pd.read_csv ('File_Path \ Data_Name.csv') # You can read this on your IDE on PC.

df = pd.read_csv ("../ input / Data_Name.csv") # Kaggle to write a kernel (but the update is sometimes not working)

dataset.to_csv ('Data_Name') # To convert the data back to csv

excelset = pd.read_excel ('Excels_Name.xlsx') # To read the Excel File

excelset.to_excel ('excelnewfile.xlsx') # Convert to Excel file

New = pd.read_html ('Datasets URL.html') # To read data on the Internet


There are many more functions(Like Pandas_Profiling) but you need to know these to enter this magical world.


 I hope you have learned something and thank you for coming to this tutorial. You can like the tutorial to motivate me. I will soon post an article about statistics.
take good care of yourself


if you want to communicate, you can click on the links below
Linkedln: https://www.linkedin.com/in/batuhan-bayraktar-a212b418a/
Medium : https://medium.com/@Batuhan35

In [187]:
print('Have a Nice Day')

Have a Nice Day